app/controllers/games_controller.rb

SELECT * FROM `games` WHERE (`games`.`id` = 203)
UPDATE `game_results` SET `updated_at` = '2009-11-23 15:49:08', `away_team_score` = 2, `finished` = 1, `away_team_points` = 0, `home_team_points` = 3, `home_team_score` = 5 WHERE `id` = 1
---
  def update
    @game = Game.find params[:id]
    home_team_score = params[:home_team_score].to_i
    away_team_score = params[:away_team_score].to_i
    if params[:home_team_points] and params[:away_team_points]
      home_team_points = params[:home_team_points].to_i
      away_team_points = params[:away_team_point].to_i
    elsif home_team_score > away_team_score
      home_team_points = 3
      away_team_points = 0
    elsif home_team_score < away_team_score
      home_team_points = 0
      away_team_points = 3
    else
      home_team_points = 1
      away_team_points = 1
    end
    @game.update_result home_team_score, away_team_score, home_team_points,
      away_team_points

SELECT * FROM `games` WHERE (`games`.`id` = 134)
---
  def play
    @game = Game.find params[:id]