app/controllers/people_controller.rb

SELECT * FROM `teams`
---
  def new
    @person = Person.new
		@teams = { 'Brak' => nil }
		Team.all.each do |t|