app/controllers/players_controller.rb

SELECT * FROM `players` WHERE (`players`.user_id = 1) LIMIT 0, 9
---
  def index
		page = params[:page] || 1
		@players = current_user.players.paginate(:page => page, :per_page => PLAYERS_PER_PAGE)

SELECT * FROM `positions`
---
	def find_positions
		positions = { 'Brak' => nil }
		Position.all.each do |p|

SELECT * FROM `teams` WHERE (`teams`.user_id = 1)
---
	def find_teams
		teams = { 'Brak' => nil }
		current_user.teams.each do |t|