app/controllers/teams_controller.rb

  def show
    @team = Team.find(params[:id])
---
SELECT * FROM `teams` WHERE (`teams`.`id` = 10)

  def create
		params[:team][:year_founded] = params[:team].delete(:"year_founded(1i)")
		params[:team].delete(:"year_founded(2i)")
		params[:team].delete(:"year_founded(3i)")
    @team = Team.new(params[:team])
		@team.user = current_user
		saved = @team.save
---
INSERT INTO `teams` (`name`, `city`, `year_founded`, `created_at`, `captain_id`, `updated_at`, `manager_id`, `trainer_id`, `user_id`, `description`) VALUES('Luk Term', '', 2009, '2009-11-05 17:49:45', NULL, '2009-11-05 17:49:45', NULL, NULL, 1, '')

	def manage_players
		@team = Team.find(params[:id])
---
SELECT * FROM `teams` WHERE (`teams`.`id` = 1)

	def add_player
		@team = Team.find(params[:id])
		if params[:player_id]
			player = Player.find(params[:player_id])
			if @team.players.include?(player)
				saved = false
			else
				@team.players << player
				saved = @team.save
---
SELECT * FROM `teams` WHERE (`teams`.`id` = 1)
SELECT * FROM `players` WHERE (`players`.user_id = 1) AND ((team_id is null) AND (`players`.user_id = 1))
UPDATE `players` SET `updated_at` = '2009-11-05 17:53:58', `team_id` = 1 WHERE `id` = 1

	def remove_player
		@team = Team.find(params[:id])
		if params[:player_id]
			player = Player.find(params[:player_id])
			if @team.players.include?(player)
				@team.players.delete(player)
				player.team = nil
				saved = @team.save
---
SELECT * FROM `teams` WHERE (`teams`.`id` = 1)
SELECT * FROM `players` WHERE (`players`.user_id = 1) AND ((team_id is null) AND (`players`.user_id = 1))
UPDATE `players` SET `updated_at` = '2009-11-05 17:52:11', `team_id` = NULL WHERE `id` = 1