app/controllers/tournaments_controller.rb

  def add_team
    @tournament = Tournament.find params[:id]
    if params[:team_id]
      team = Team.find params[:team_id]
      if @tournament.teams.include? team
---
SELECT `teams`.id FROM `teams` INNER JOIN `tournament_teams` ON `teams`.id = `tournament_teams`.team_id WHERE (`teams`.`id` = 1) AND ((`tournament_teams`.tournament_id = 2)) LIMIT 1

  def remove_team
    @tournament = Tournament.find params[:id]
    if params[:team_id]
      team = Team.find params[:team_id]
      if @tournament.teams.include? team
---
SELECT `teams`.id FROM `teams` INNER JOIN `tournament_teams` ON `teams`.id = `tournament_teams`.team_id WHERE (`teams`.`id` = 5) AND ((`tournament_teams`.tournament_id = 2)) LIMIT 1