app/controllers/tournaments_controller.rb

INSERT INTO `tournaments` (`name`, `start_date`, `created_at`, `tournament_type_id`, `switch_duration`, `updated_at`, `game_duration`, `organizer`, `user_id`, `description`, `end_date`) VALUES('II KLH', '2009-11-05', '2009-11-05 17:54:12', NULL, NULL, '2009-11-05 17:54:12', NULL, '', 1, '', '2009-11-05')
---
  def create
    @tournament = Tournament.new(params[:tournament])
		@tournament.user = current_user
		saved = @tournament.save

DELETE FROM `tournaments` WHERE `id` = 3
---
  def destroy
    @tournament.destroy

INSERT INTO `tournament_metadata` (`created_at`, `updated_at`, `default_game_duration`, `tournament_id`, `teams_count`, `games_count`) VALUES('2009-11-05 17:54:12', '2009-11-05 17:54:12', NULL, 2, NULL, NULL)
---
  def manage_type
    if @tournament.tournament_metadata
      @metadata = @tournament.tournament_metadata
    else
      @metadata = TournamentMetadata.new
      @metadata.tournament = @tournament
      @metadata.save

UPDATE `tournament_metadata` SET `updated_at` = '2009-11-05 17:54:20', `teams_count` = 4, `default_game_duration` = 40, `games_count` = 2 WHERE `id` = 2
---
  def update_type
    metadata = @tournament.tournament_metadata
    metadata.teams_count = params[:tournament_metadata][:teams_count].to_i
    metadata.games_count = params[:tournament_metadata][:games_count].to_i
    metadata.default_game_duration =
      params[:tournament_metadata][:default_game_duration].to_i
    saved = metadata.save

SELECT * FROM `tournament_metadata` WHERE (`tournament_metadata`.tournament_id = 3) LIMIT 1
SELECT `teams`.* FROM `teams` INNER JOIN `tournament_teams` ON `teams`.id = `tournament_teams`.team_id WHERE ((`tournament_teams`.tournament_id = 3))
---
  def generate_empty_schedule
    if @tournament.fields.size == 0
      flash[:warning] = "Musisz najpierw dodać do turnieju przynajmniej jedno boisko"
    elsif @tournament.teams.size != @tournament.tournament_metadata.teams_count

SELECT * FROM `tournament_metadata` WHERE (`tournament_metadata`.tournament_id = 3) LIMIT 1
SELECT `teams`.* FROM `teams` INNER JOIN `tournament_teams` ON `teams`.id = `tournament_teams`.team_id WHERE ((`tournament_teams`.tournament_id = 3))
---
  def generate_round_robin_schedule
    if @tournament.fields.size == 0
      flash[:warning] = "Musisz najpierw dodać do turnieju przynajmniej jedno boisko"
    elsif @tournament.teams.size != @tournament.tournament_metadata.teams_count

SELECT `teams`.* FROM `teams` INNER JOIN `tournament_teams` ON `teams`.id = `tournament_teams`.team_id WHERE ((`tournament_teams`.tournament_id = 2))
INSERT INTO `tournament_teams` (`created_at`, `updated_at`, `tournament_id`, `team_id`) VALUES('2009-11-05 17:54:50', '2009-11-05 17:54:50', 2, 1)
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def add_team
    if @tournament.teams.include? @team
      saved = false
    else
      @tournament.teams << @team
      saved = @tournament.save
    end
    respond_to do |format|
      format.js do
        if saved
          render :update do |page|
            page.replace_html 'teams-in-tournament', :partial => 'teams',
              :object => @tournament.teams
            page.replace_html 'teams-not-in-tournament', :partial => 'teams',
              :object => @tournament.user.teams.all(:conditions => ['id not in (?)',
                ((@tournament.teams.collect { |t| t.id }) << -1)]
              )

SELECT `teams`.* FROM `teams` INNER JOIN `tournament_teams` ON `teams`.id = `tournament_teams`.team_id WHERE ((`tournament_teams`.tournament_id = 2))
DELETE FROM `tournament_teams` WHERE (`tournament_teams`.`tournament_id` = 2 AND `tournament_teams`.`team_id` = 5)
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def remove_team
    if @tournament.teams.include? @team
      @tournament.teams.delete @team
      @team.tournaments.delete @tournament
      # TODO: rollback if one of the saves goes wrong
      saved = @tournament.save
      saved = saved && @team.save
    else
      saved = false
    end
    respond_to do |format|
      format.js do
        if saved
          render :update do |page|
            page.replace_html 'teams-in-tournament', :partial => 'teams',
              :object => @tournament.teams
            page.replace_html 'teams-not-in-tournament', :partial => 'teams',
              :object => @tournament.user.teams.all(:conditions => ['id not in (?)',
                ((@tournament.teams.collect { |t| t.id }) << -1)]
              )

SELECT * FROM `games` WHERE (`games`.tournament_id = 3) AND ((game_slot_id is null) AND (`games`.tournament_id = 3))
SELECT * FROM `game_slots` WHERE (`game_slots`.tournament_id = 3)
UPDATE `games` SET `updated_at` = '2009-11-23 15:32:42', `game_slot_id` = 24 WHERE `id` = 44
---
  def schedule_game
    game = Game.find params[:game_id]
    game_slot = GameSlot.find params[:game_slot_id]
    game_slot.game = nil
    game.game_slot = game_slot
    game_slot.save

SELECT * FROM `game_slots` WHERE (`game_slots`.tournament_id = 3)
UPDATE `games` SET `updated_at` = '2009-11-23 15:32:30', `game_slot_id` = NULL WHERE `id` = 44
---
  def unschedule_game
    game_slot = GameSlot.find params[:game_slot_id]
    game_slot.game = nil
    game_slot.save

SELECT * FROM `tournaments` WHERE (`tournaments`.user_id = 1)
---
    def find_tournament
      @tournament = Tournament.find params[:id]

SELECT * FROM `games` WHERE (`games`.tournament_id = 3) AND ((game_slot_id is null) AND (`games`.tournament_id = 3))
---
    def find_game
      @game = Game.find params[:game_id]

SELECT * FROM `game_slots` WHERE (`game_slots`.tournament_id = 3)
---
    def find_game_slot
      @game_slot = GameSlot.find params[:game_slot_id]

SELECT * FROM `teams` WHERE (id not in (1,2,3,4,5,6,-1))
---
    def find_team
      @team = Team.find params[:team_id]