app/controllers/users_controller.rb

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO `users` (`salt`, `name`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `is_admin`, `remember_token`, `show_page_info`, `login`, `email`) VALUES('4f406468cda8c77edae434dcaac984480cca8634', NULL, '2009-11-03 18:45:34', 'dfe385b663e58f0d32760c7d6471fecec906cf89', NULL, '2009-11-03 18:45:34', 0, NULL, 1, 'mariusz', 'mariusz@mailinator.com')

	def update
		respond_to do |format|
			if @user.update_attributes(params[:user])
---
UPDATE `users` SET `updated_at` = '2009-11-04 17:21:17', `name` = '', `show_page_info` = 0 WHERE `id` = 1

	def find_user
		@user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1