app/controllers/users/players_controller.rb

SELECT * FROM `players` WHERE (`players`.user_id = 1) LIMIT 0, 9
---
  def index
		page = params[:page] || 1
		@players = @user.players.paginate(:page => page, :per_page => PLAYERS_PER_PAGE)

SELECT * FROM `players` WHERE (`players`.`id` = 1)
---
  def show
    @player = Player.find(params[:id])

SELECT * FROM `players` WHERE (`players`.`id` = 1)
---
  def edit
    @player = Player.find(params[:id])

INSERT INTO `avatars` (`size`, `created_at`, `content_type`, `obj_id`, `thumbnail`, `updated_at`, `obj_type`, `parent_id`, `filename`, `height`, `width`) VALUES(97013, '2009-11-04 16:14:44', 'image/jpeg', NULL, NULL, '2009-11-04 16:14:44', NULL, NULL, 'losiu.JPG', NULL, NULL)
INSERT INTO `players` (`name`, `created_at`, `updated_at`, `user_id`, `current_number`, `position_id`, `description`, `date_of_birth`, `team_id`, `first_name`) VALUES('Łusiak', '2009-11-04 16:14:44', '2009-11-04 16:14:44', 1, 13, NULL, '', '1984-01-19', 1, 'Mariusz')
---
  def create
		avatar = Avatar.new(params[:avatar])
		avatar_saved = avatar.save
    @player = Player.new(params[:player])
		@player.user = @user
		if avatar_saved
			@player.avatar = avatar
		end
		saved = @player.save

SELECT * FROM `players` WHERE (`players`.`id` = 1)
---
  def update
    @player = Player.find(params[:id])

SELECT * FROM `players` WHERE (`players`.`id` = 1)
---
	def avatar
		@player = Player.find(params[:id])

INSERT INTO `avatars` (`size`, `created_at`, `content_type`, `obj_id`, `thumbnail`, `updated_at`, `obj_type`, `parent_id`, `filename`, `height`, `width`) VALUES(48660, '2009-11-04 16:46:39', 'image/jpeg', NULL, NULL, '2009-11-04 16:46:39', NULL, NULL, 'cortina.JPG', NULL, NULL)
SELECT * FROM `players` WHERE (`players`.`id` = 1)
UPDATE `avatars` SET `updated_at` = '2009-11-04 16:46:39', `obj_id` = 1, `obj_type` = 'Player' WHERE `id` = 2
---
	def add_avatar
		avatar = Avatar.new(params[:avatar])
		avatar_saved = avatar.save
    @player = Player.find(params[:id])
		if avatar_saved
			@player.avatar = avatar
		end
		saved = @player.save

SELECT * FROM `players` WHERE (`players`.`id` = 1)
DELETE FROM `avatars` WHERE `id` = 1
---
	def remove_avatar
		@player = Player.find(params[:id])
		av = @player.avatar
		av.destroy if av

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
	def find_user
		@user = User.find(params[:user_id])

SELECT * FROM `positions`
---
	def find_positions
		positions = { 'Brak' => nil }
		Position.all.each do |p|

SELECT * FROM `teams` WHERE (`teams`.user_id = 1)
---
	def find_teams
		teams = { 'Brak' => nil }
		@user.teams.each do |t|