app/controllers/users/teams_controller.rb

  def show
    @team = Team.find(params[:id])
---
SELECT * FROM `teams` WHERE (`teams`.`id` = 1)

  def create
		params[:team][:year_founded] = params[:team].delete(:"year_founded(1i)")
		params[:team].delete(:"year_founded(2i)")
		params[:team].delete(:"year_founded(3i)")
    @team = Team.new(params[:team])
		@team.user = @user
		saved = @team.save
---
INSERT INTO `teams` (`name`, `city`, `year_founded`, `created_at`, `captain_id`, `updated_at`, `manager_id`, `trainer_id`, `user_id`, `description`) VALUES('Walkover Tripy.pl', 'Kraków', 2005, '2009-11-03 18:46:52', NULL, '2009-11-03 18:46:52', NULL, NULL, 1, '')

	def manage_players
		@team = Team.find(params[:id])
---
SELECT * FROM `teams` WHERE (`teams`.`id` = 1)

	def add_player
		@team = Team.find(params[:id])
		if params[:player_id]
			player = Player.find(params[:player_id])
			if @team.players.include?(player)
				saved = false
			else
				@team.players << player
				saved = @team.save
---
SELECT * FROM `teams` WHERE (`teams`.`id` = 1)
SELECT * FROM `players` WHERE (`players`.user_id = 1) AND ((team_id is null) AND (`players`.user_id = 1))
UPDATE `players` SET `updated_at` = '2009-11-04 17:25:18', `team_id` = 1 WHERE `id` = 1

	def find_user
		@user = User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1