app/controllers/users/tournaments_controller.rb

SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)
---
  def show
    @tournament = Tournament.find(params[:id])

INSERT INTO `tournaments` (`name`, `start_date`, `created_at`, `tournament_type_id`, `switch_duration`, `updated_at`, `game_duration`, `organizer`, `user_id`, `description`, `end_date`) VALUES('Turniej zimowy', '2009-11-04', '2009-11-04 17:38:08', NULL, NULL, '2009-11-04 17:38:08', NULL, '', 1, '', '2009-11-04')
---
  def create
    @tournament = Tournament.new(params[:tournament])
		@tournament.user = @user
		saved = @tournament.save

SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)
INSERT INTO `tournament_metadata` (`created_at`, `updated_at`, `default_game_duration`, `tournament_id`, `teams_count`, `games_count`) VALUES('2009-11-04 17:38:09', '2009-11-04 17:38:09', NULL, 1, NULL, NULL)
---
  def manage_type
    @tournament = Tournament.find params[:id]
    if @tournament.tournament_metadata
      @metadata = @tournament.tournament_metadata
    else
      @metadata = TournamentMetadata.new
      @metadata.tournament = @tournament
      @metadata.save

SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)
UPDATE `tournament_metadata` SET `updated_at` = '2009-11-04 17:38:17', `teams_count` = 4, `default_game_duration` = 40, `games_count` = 2 WHERE `id` = 1
---
  def update_type
    @tournament = Tournament.find params[:id]
    metadata = @tournament.tournament_metadata
    metadata.teams_count = params[:tournament_metadata][:teams_count].to_i
    metadata.games_count = params[:tournament_metadata][:games_count].to_i
    metadata.default_game_duration =
      params[:tournament_metadata][:default_game_duration].to_i
    saved = metadata.save

SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)
---
  def manage_teams
    @tournament = Tournament.find params[:id]

SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)
---
  def update_teams
    @tournament = Tournament.find params[:id]

SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)
---
  def schedule
    @tournament = Tournament.find params[:id]

SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)
SELECT * FROM `teams` WHERE (id not in (1,2,7,9,-1))
SELECT `teams`.id FROM `teams` INNER JOIN `tournament_teams` ON `teams`.id = `tournament_teams`.team_id WHERE (`teams`.`id` = 1) AND ((`tournament_teams`.tournament_id = 1)) LIMIT 1
INSERT INTO `tournament_teams` (`created_at`, `updated_at`, `tournament_id`, `team_id`) VALUES('2009-11-04 17:38:20', '2009-11-04 17:38:20', 1, 1)
---
  def add_team
    @tournament = Tournament.find params[:id]
    if params[:team_id]
      team = Team.find params[:team_id]
      if @tournament.teams.include? team
        saved = false
      else
        @tournament.teams << team

SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)
SELECT * FROM `teams` WHERE (id not in (1,2,7,-1))
SELECT `teams`.id FROM `teams` INNER JOIN `tournament_teams` ON `teams`.id = `tournament_teams`.team_id WHERE (`teams`.`id` = 9) AND ((`tournament_teams`.tournament_id = 1)) LIMIT 1
DELETE FROM `tournament_teams` WHERE (`tournament_teams`.`tournament_id` = 1 AND `tournament_teams`.`team_id` = 9)
---
  def remove_team
    @tournament = Tournament.find params[:id]
    if params[:team_id]
      team = Team.find params[:team_id]
      if @tournament.teams.include? team
        @tournament.teams.delete team

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
	def find_user
		@user = User.find(params[:user_id])